//=============================================================================
//
// モデル処理 [barrel.h]
// Author : 荒山 秀磨
//
//=============================================================================
#pragma once

#include <DirectXMath.h>
using namespace DirectX;

//*****************************************************************************
// マクロ定義
//*****************************************************************************
constexpr float BARREL_SIZE_X = 10.0f; // 当たり判定の大きさ
constexpr float BARREL_SIZE_Y = 20.0f;
constexpr float BARREL_SIZE_Z = 10.0f;
constexpr float BARREL_SIZE = 10.0f;
constexpr int BARREL_MAX = 5; // 樽の最大数

//*****************************************************************************
// 型定義
//*****************************************************************************
typedef int BOOL; // 4バイトのBOOL型定義

//*****************************************************************************
// 構造体定義
//*****************************************************************************
struct BARREL
{
    XMFLOAT4X4 mtxWorld; // ワールドマトリックス
    XMFLOAT3 pos;        // ポリゴンの位置
    XMFLOAT3 rot;        // ポリゴンの向き(回転)
    XMFLOAT3 scl;        // ポリゴンの大きさ(スケール)
    XMFLOAT3 size;       // 当たり判定の大きさ

    BOOL use;  // TRUE:使用 / FALSE:未使用
    BOOL draw; // TRUE:表示 / FALSE:非表示

    int modelNo;    // モデルの種類
    int shadowIdx;  // 影のIndex
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitBarrel();
void UninitBarrel();
void UpdateBarrel();
void DrawBarrel();

BARREL* GetBarrel();
