//=============================================================================
//
// モデル処理 [bomb.h]
// Author : 
//
//=============================================================================
#pragma once

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define	BOMB_SIZE_X		(10.0f)	// 当たり判定の大きさ
#define	BOMB_SIZE_Y		(20.0f)
#define	BOMB_SIZE_Z		(10.0f)
#define	BOMB_SIZE		(10.0f)
#define BOMB_MAX           (2)	// 爆弾の最大数

//*****************************************************************************
// 構造体定義
//*****************************************************************************
struct BOMB
{
	XMFLOAT4X4	mtxWorld;	// ワールドマトリックス
	XMFLOAT3	pos;		// ポリゴンの位置
	XMFLOAT3	rot;		// ポリゴンの向き(回転)
	XMFLOAT3	scl;		// ポリゴンの大きさ(スケール)
	XMFLOAT3	size;		// 当たり判定の大きさ

	BOOL		use;		// TRUE:使用 / FALSE:未使用
	BOOL		draw;		// TRUE:表示 / FALSE:非表示
	BOOL		exFlag;		// TRUE:爆発 / FALSE:未爆発

	float		exTime;		// 爆発時間
	int			modelNo;	// モデルの種類
	int			shadowIdx;	// 影のIndex
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitBomb(void);
void UninitBomb(void);
void UpdateBomb(void);
void DrawBomb(void);

BOMB* GetBomb(void);