//=============================================================================
//
// モデル処理 [box.h]
// Author : 
//
//=============================================================================
#pragma once


//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define	BOX_SIZE_X		 (60.0f)	// 当たり判定の大きさ
#define	BOX_SIZE_Y		(100.0f)
#define	BOX_SIZE_Z		 (100.0f)

#define BOX_MAX             (1)	// 馬車の最大数

//*****************************************************************************
// 構造体定義
//*****************************************************************************
struct BOX
{
	XMFLOAT4X4		mtxWorld;			// ワールドマトリックス
	XMFLOAT3		pos;				// ポリゴンの位置
	XMFLOAT3		rot;				// ポリゴンの向き(回転)
	XMFLOAT3		scl;				// ポリゴンの大きさ(スケール)
	XMFLOAT3		size;				// 当たり判定の大きさ

	BOOL			use;
	BOOL			draw;				//表示判定
	BOOL			load;
	DX11_MODEL		model;				// モデル情報

	int				shadowIdx;			// 影のIndex
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitBox(void);
void UninitBox(void);
void UpdateBox(void);
void DrawBox(void);

BOX* GetBox(void);

