//=============================================================================
//
// モデル処理 [dungeon.h]
// Author : 
//
//=============================================================================
#pragma once


//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define	DUNGEON_SIZE_X		(90.0f)				// 当たり判定の大きさ
#define	DUNGEON_SIZE_Y		(100.0f)			// 当たり判定の大きさ
#define	DUNGEON_SIZE_Z		(120.0f)

#define DUNGEON_MAX         (1)				// ダンジョンの最大数

//*****************************************************************************
// 構造体定義
//*****************************************************************************
struct DUNGEON
{
	XMFLOAT4X4		mtxWorld;			// ワールドマトリックス
	XMFLOAT3		pos;				// ポリゴンの位置
	XMFLOAT3		rot;				// ポリゴンの向き(回転)
	XMFLOAT3		scl;				// ポリゴンの大きさ(スケール)
	XMFLOAT3		size;				// 当たり判定の大きさ

	BOOL			use;
	BOOL			draw;				//表示判定
	BOOL			load;
	DX11_MODEL		model;				// モデル情報

	int				shadowIdx;			// 影のIndex
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitDungeon(void);
void UninitDungeon(void);
void UpdateDungeon(void);
void DrawDungeon(void);

DUNGEON* GetDungeon(void);

