//=============================================================================
//
// モデル処理 [fence.h]
// Author : 
//
//=============================================================================
#pragma once


//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define	FENCE_SIZE_X		(70.0f)	// 当たり判定の大きさ
#define	FENCE_SIZE_Y		(60.0f)
#define	FENCE_SIZE_Z		(20.0f)

#define FENCE_MAX         (26)	// 柵の最大数

//*****************************************************************************
// 構造体定義
//*****************************************************************************
struct FENCE
{
	XMFLOAT4X4	mtxWorld;	// ワールドマトリックス
	XMFLOAT3	pos;		// ポリゴンの位置
	XMFLOAT3	rot;		// ポリゴンの向き(回転)
	XMFLOAT3	scl;		// ポリゴンの大きさ(スケール)
	XMFLOAT3	size;		// 当たり判定の大きさ

	BOOL		use;		// TRUE:使用 / FALSE:未使用
	BOOL		draw;		// TRUE:表示 / FALSE:非表示

	int			modelNo;	// モデルの種類
	int			shadowIdx;	// 影のIndex
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitFence(void);
void UninitFence(void);
void UpdateFence(void);
void DrawFence(void);

FENCE* GetFence(void);

