//=============================================================================
//
// モデル処理 [house.h]
// Author : 
//
//=============================================================================
#pragma once


//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define	HOUSE_SIZE_X   	(90.0f)			// 当たり判定の大きさ
#define	HOUSE_SIZE_Y   	(50.0f)
#define	HOUSE_SIZE_Z   	(100.0f)

#define HOUSE_MAX       (3)			// 家の最大数


//*****************************************************************************
// 構造体定義
//*****************************************************************************
struct HOUSE
{
	XMFLOAT4X4		mtxWorld;			// ワールドマトリックス
	XMFLOAT3		pos;				// ポリゴンの位置
	XMFLOAT3		rot;				// ポリゴンの向き(回転)
	XMFLOAT3		scl;				// ポリゴンの大きさ(スケール)
	XMFLOAT3		size;				// 当たり判定の大きさ

	BOOL			use;
	BOOL			draw;				//表示判定

	DX11_MODEL		model;				// モデル情報

	int				modelNo;			// モデル番号
	int				shadowIdx;			// 影のIndex
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitHouse(void);
void UninitHouse(void);
void UpdateHouse(void);
void DrawHouse(void);

HOUSE* GetHouse(void);

