//=============================================================================
//
// ライト処理 [light.cpp]
// Author : 
//
//=============================================================================
#include "main.h"
#include "renderer.h"
#include "light.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************



//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************


//*****************************************************************************
// グローバル変数
//*****************************************************************************
static LIGHT	light[LIGHT_MAX];

static FOG		fog;

static BOOL		fogEnable = FALSE;


//=============================================================================
// 初期化処理
//=============================================================================
void InitLight(void)
{

	//ライト初期化
	for (int i = 0; i < LIGHT_MAX; i++)
	{
		light[i].Position = XMFLOAT3(0.0f, 0.0f, 0.0f);
		light[i].Direction = XMFLOAT3(0.0f, -1.0f, 0.0f);
		light[i].Diffuse = XMFLOAT4(1.0f, 1.0f, 1.0f, 1.0f);
		light[i].Ambient = XMFLOAT4(1.0f, 1.0f, 1.0f, 1.0f);
		light[i].Attenuation = 100.0f;	// 減衰距離
		light[i].Type = LIGHT_TYPE_NONE;	// ライトのタイプ
		light[i].Enable = FALSE;			// ON / OFF
		SetLight(i, &light[i]);
	}

	// 並行光源の設定（世界を照らす光）
	light[0].Direction = XMFLOAT3( 0.0f, -1.0f, 0.0f);	// 光の向き
	light[0].Diffuse = XMFLOAT4( 1.5f, 1.5f, 1.5f, 1.0f);	// 光の色
	light[0].Type = LIGHT_TYPE_DIRECTIONAL;				// 並行光源
	light[0].Enable = TRUE;								// このライトをON
	SetLight(0, &light[0]);								// これで設定している



	// フォグの初期化（霧の効果）
	fog.FogStart = 100.0f;								// 視点からこの距離離れるとフォグがかかり始める
	fog.FogEnd = 250.0f;									// ここまで離れるとフォグの色で見えなくなる
	fog.FogColor = XMFLOAT4(1.0f, 1.0f, 1.0f, 1.0f);		// フォグの色
	SetFog(&fog);
	SetFogEnable(fogEnable);				// 他の場所もチェックする shadow

}


//=============================================================================
// 更新処理
//=============================================================================
void UpdateLight(void)
{



}

//=============================================================================
// ライトの設定
// Typeによってセットするメンバー変数が変わってくる
//=============================================================================
void SetLightData(int index, LIGHT* light)
{
	SetLight(index, light);
}


LIGHT* GetLightData(int index)
{
	return(&light[index]);
}


//=============================================================================
// フォグの設定
//=============================================================================
void SetFogData(FOG* fog)
{
	SetFog(fog);
}

FOG * GetFog(void)
{
	return &fog;
}

BOOL GetFogEnable(void)
{
	return(fogEnable);
}


