//=============================================================================
//
// モデル処理 [speartrap.h]
// Author : 荒山 秀磨
//
//=============================================================================
#pragma once

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define	TRAP_SIZE		(10.0f)	// 当たり判定の大きさ
#define TRAP_MAX         (1)	// 槍の最大数

//*****************************************************************************
// 構造体定義
//*****************************************************************************
struct TRAP
{
	XMFLOAT4X4	mtxWorld;	// ワールドマトリックス
	XMFLOAT3    pos;		// 槍の位置
	XMFLOAT3	rot;		// 槍の向き(回転)
	XMFLOAT3	scl;		// 槍の大きさ(スケール)

	BOOL		use;		// TRUE:使用 / FALSE:未使用
	BOOL		draw;		// TRUE:表示 / FALSE:非表示

	float		time;		// スピアが出る時間
	float		size;		// 当たり判定の大きさ
	int			status;		// 槍のトラップの状態
	int			modelNo;	// モデルの種類
	int			shadowIdx;	// 影のIndex
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitTrap(void);
void UninitTrap(void);
void UpdateTrap(void);
void DrawTrap(void);

TRAP* GetTrap(void);