//=============================================================================
//
// モデル処理 [stall.h]
// Author : 
//
//=============================================================================
#pragma once


//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define	STALL_SIZE_X		(60.0f)				// 当たり判定の大きさ
#define	STALL_SIZE_Y		(100.0f)
#define	STALL_SIZE_Z		(30.0f)

#define STALL_MAX         (1)				// 屋台の最大数

//*****************************************************************************
// 構造体定義
//*****************************************************************************
struct STALL
{
	XMFLOAT4X4		mtxWorld;			// ワールドマトリックス
	XMFLOAT3		pos;				// ポリゴンの位置
	XMFLOAT3		rot;				// ポリゴンの向き(回転)
	XMFLOAT3		scl;				// ポリゴンの大きさ(スケール)
	XMFLOAT3		size;				// 当たり判定の大きさ

	BOOL			use;
	BOOL			draw;				//表示判定
	BOOL			load;
	DX11_MODEL		model;				// モデル情報

	int				shadowIdx;			// 影のIndex
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitStall(void);
void UninitStall(void);
void UpdateStall(void);
void DrawStall(void);

STALL* GetStall(void);

